app/controllers/players/registrations_controller.rb

  def create
    super
    current_player.characters.create(
        health: 100,
        hype: 0,
        armor: 10,
        damage: 10,
        speed: 10,
        is_enemy: false,
        base_health: 100,
        base_damage: 10,
        cash: 30,
        kills: 0)
---
INSERT INTO "characters" ("health", "hype", "armor", "damage", "speed", "is_enemy", "base_health", "base_damage", "cash", "kills", "player_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "players" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"