app/controllers/cave_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", 58]]
SELECT  "characters".* FROM "characters" WHERE "characters"."name" = $1 LIMIT 1  [["name", "Monster 4"]]
---
  def deeper
  	  @links = {"Leave Cave" => root_path, "Deeper" => deeper_path}
      @player = get_character
      if params[:id]
        @enemy = Character.find(params[:id].to_i)
        $last_id = @enemy.id
        p "params exist"
      elsif @player.kills == 5
        redirect_to win_path
        p "win"
      else
        @enemy =Character.find_by(name: "Monster " + (@player.kills + 1).to_s)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "characters" SET "kills" = $1, "cash" = $2, "hype" = $3, "updated_at" = $4 WHERE "characters"."id" = $5  [["kills", 3], ["cash", 35], ["hype", 25], ["updated_at", "2015-12-03 05:41:43.937978"], ["id", 65]]
INSERT INTO "characters" ("health", "hype", "armor", "damage", "speed", "is_enemy", "base_health", "base_damage", "cash", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def attack
    @player = get_character
    @enemy = Character.find(params[:id].to_i)
    @enemy.health -= @player.damage
    @enemy.save

    if @enemy.health <= 0
      @player.kills += 1
      @player.cash += @enemy.cash
      @player.hype += @enemy.hype
      @enemy.health = 0
      @player.save