app/controllers/main_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 1]]
---
    def index
        @location= Location.find(1)

SELECT  "characters".* FROM "characters" WHERE "characters"."player_id" = $1 AND "characters"."id" = $2 LIMIT 1  [["player_id", 3], ["id", 1]]
UPDATE "characters" SET "health" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["health", nil], ["updated_at", "2015-12-01 19:17:26.790349"], ["id", 1]]
---
    def sleep
        @player = current_player
        @character = @player.characters.find(1)

        @character.health = @character.base_health
        @character.damage = @characate.base_damage
        @character.save