app/controllers/shop_controller.rb

  def buy
  	@items = shop_items
  	@character = get_character
  	@type = @items[params[:type].to_i]
	@item = @type[params[:name]]

	if @character.cash && @character.cash >= @item[0].to_i
		@character.cash -= @item[0]
		@character.items.create name: params[:name], cost: @item[0], damage: @item[1], armor: @item[2], speed: @item[3]
        @cash = @character.cash
        @character.save
---
INSERT INTO "items" ("name", "cost", "damage", "armor", "speed", "character_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "characters" SET "cash" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["cash", 20], ["updated_at", "2015-12-03 07:10:26.127172"], ["id", 35]]