app/controllers/win_controller.rb

    def index
    	@player = get_character
    	@player.kills = 0
    	@player.health = @player.base_health
    	@player.cash = 30
    	@player.hype = 0
    	@player.save
    	i = 1
    	while i <= 5
    		a = Character.find_by(name: "Monster " + i.to_s)
---
UPDATE "characters" SET "kills" = $1, "health" = $2, "cash" = $3, "hype" = $4, "updated_at" = $5 WHERE "characters"."id" = $6  [["kills", 0], ["health", 100], ["cash", 30], ["hype", 0], ["updated_at", "2015-12-03 07:03:07.091959"], ["id", 29]]
SELECT  "characters".* FROM "characters" WHERE "characters"."name" = $1 LIMIT 1  [["name", "Monster 1"]]